In [8]:
import pandas as pd
df = pd.read_csv('emp.csv')

In [9]:
df

    eno   ename  salary  deptno         doj
0    10   Amber    1000      10  2018-05-14
1     2    Amar    1000      10  2017-03-22
2     8   Sagar    1000      20  2020-11-30
3     4  Thomas    1000      10  2019-08-18
4     5    Jade    2000      10  2021-02-10
5     6   Smith    1000      10  2016-12-01
6     7  Robert    3000      20  2023-06-25
7     3    Nick    1000      30  2015-09-15
8     9   Naman    4000      30  2020-01-20
9     1   Vikas    1000      30  2017-10-03
10   11  Dennis   41000      30  2024-01-05
11   12   Karan    2200      20  2018-06-16
12   13  Simran    1500      10  2019-12-19
13   14    Amit    2000      30  2022-04-09
14   15    Neha    1700      20  2021-07-22
15   16   Rahul    1200      10  2016-03-28

In [11]:
df.columns

Index(['eno', 'ename', 'salary', 'deptno', 'doj'], dtype='object')

In [13]:
df2 = pd.read_csv('emp.csv',usecols=['eno','ename'])
df2

    eno   ename
0    10   Amber
1     2    Amar
2     8   Sagar
3     4  Thomas
4     5    Jade
5     6   Smith
6     7  Robert
7     3    Nick
8     9   Naman
9     1   Vikas
10   11  Dennis
11   12   Karan
12   13  Simran
13   14    Amit
14   15    Neha
15   16   Rahul

In [14]:
df2.tail(5)

    eno   ename
11   12   Karan
12   13  Simran
13   14    Amit
14   15    Neha
15   16   Rahul

In [15]:
df.head(5)

   eno   ename  salary  deptno         doj
0   10   Amber    1000      10  2018-05-14
1    2    Amar    1000      10  2017-03-22
2    8   Sagar    1000      20  2020-11-30
3    4  Thomas    1000      10  2019-08-18
4    5    Jade    2000      10  2021-02-10

In [17]:
x=df['salary']
x

0      1000
1      1000
2      1000
3      1000
4      2000
5      1000
6      3000
7      1000
8      4000
9      1000
10    41000
11     2200
12     1500
13     2000
14     1700
15     1200
Name: salary, dtype: int64

In [18]:
df.loc[1,'ename']

'Amar'

In [19]:
df.loc[1:4,'ename']

1      Amar
2     Sagar
3    Thomas
4      Jade
Name: ename, dtype: object

In [20]:
df.loc[df['salary']>1000]

    eno   ename  salary  deptno         doj
4     5    Jade    2000      10  2021-02-10
6     7  Robert    3000      20  2023-06-25
8     9   Naman    4000      30  2020-01-20
10   11  Dennis   41000      30  2024-01-05
11   12   Karan    2200      20  2018-06-16
12   13  Simran    1500      10  2019-12-19
13   14    Amit    2000      30  2022-04-09
14   15    Neha    1700      20  2021-07-22
15   16   Rahul    1200      10  2016-03-28

In [22]:
df.iloc[[11,1]]

    eno  ename  salary  deptno         doj
11   12  Karan    2200      20  2018-06-16
1     2   Amar    1000      10  2017-03-22

In [23]:
df.iloc[11,1]

'Karan'

In [24]:
df.iloc[1:5]

   eno   ename  salary  deptno         doj
1    2    Amar    1000      10  2017-03-22
2    8   Sagar    1000      20  2020-11-30
3    4  Thomas    1000      10  2019-08-18
4    5    Jade    2000      10  2021-02-10

In [25]:
df.iloc[1:5,[0,1]]

   eno   ename
1    2    Amar
2    8   Sagar
3    4  Thomas
4    5    Jade

In [31]:
df.loc[2,'eno']

np.int64(8)

In [33]:
df.iat[2,1]

'Sagar'

In [36]:
df.at[2,'ename']

'Sagar'